{
  "sidebar": {
    "headshot": "./images/headshot.jpg",
    "links": [
      {
        "icon": "./images/icons/github.svg",
        "text": "Github",
        "url": "https://github.com/TaureHorn"
      },
      {
        "icon": "./images/icons/linkedIn.svg",
        "text": "LinkedIn",
        "url": "https://www.linkedin.com/in/alex-b-39193683/"
      },
      {
        "icon": "./images/icons/document.svg",
        "text": "CV",
        "url": "CV.pdf"
      }
    ],
    "externalLinks": [
      {
        "icon": "./images/icons/developerAcademy.svg",
        "text": "The Developer Academy Bootcamp",
        "url": "https://thedeveloperacademy.com/courses/funded-software-bootcamp"
      },
      {
        "icon": "./images/icons/github.svg",
        "text": "The Developer Academy Github",
        "url": "https://github.com/TDAWebDevBootcamp"
      }
    ]
  },
  "skillsSidebar": {
    "skillList": [
      "Bash",
      "Bootstrap",
      "CSS",
      "Docker",
      "Express",
      "HTML",
      "Javascript",
      "JSON",
      "Lua",
      "MongoDB",
      "Neovim",
      "React",
      "Sass",
      "TailwindCSS"
    ]
  },
  "main": {
    "Projects": {
      "metadata": {
        "explainer": "I worked on these projects after completing the web dev bootcamp to continue learning and to implement some ideas I had during the bootcamp",
        "name": "Personal Projects"
      },
      "data": [
        {
          "info": "<p>placeholderrrrrrrrr</p>",
          "name": "Hacking Text Adventure Game",
          "repo": "https://github.com/TaureHorn/netrunner-game_v2",
          "screenshot": "./images/screenshots/netrunner.png",
          "skills": ["Javascript", "React", "Bash", "Sass"],
          "url": "https://taurehorn.github.io/netrunner-game_v2/"
        },
        {
          "info": "<p>placeholderrrrrrrrr</p>",
          "name": "Browser Startpage",
          "repo": "https://github.com/TaureHorn/krypt-browser-startpage",
          "screenshot": "./images/screenshots/krypt.png",
          "skills": ["Javascript", "React", "Express", "JSON", "Docker"]
        },
        {
          "info": "<p>placeholderrrrrrrrr</p>",
          "name": "Neovim Config",
          "repo": "https://github.com/TaureHorn/nvim_config",
          "screenshot": "./images/screenshots/nvim.png",
          "skills": ["Neovim", "Lua"]
        }
      ]
    },
    "Web Dev Bootcamp": {
      "metadata": {
        "explainer": "I started learning to code through a software bootcamp called The Developer Academy",
        "name": "Web Dev Bootcamp Projects"
      },
      "data": [
        {
          "info": "<p>A month long group project made as the final project for <a href=`https://thedeveloperacademy.com/` target=`_blank` class=linkBold>The Developer Academy</a> Web Dev Bootcamp. Having spend the previous four weeks learning how to use the MERN stack, we were tasked as a group with creating a full website on an idea of our chosing. My group chose a social media style site based on music.</p><p> This website functions similar to a mix between Spotify and Facebook. Once registered a user can browse and play from Spotify's music library without leaving the site. It also provides functionality to make a curate playlists. Further, so long as a user sets a playlist to public, other users can see a list of playlists on a timeline page, similar to a Facebook feed, for example. Here a user can interact with other users by viewing, liking or commenting on other users playlists.</p><p> I really enjoyed this project, having the time to execute on an original idea, rather than a prescribed task. We had complete control over the project design and outline and given that we had four weeks instead of the better part of a week like ususal, we had time to explore some techniques and tools we had not before.</p><p> The first of the new tools we had time to experiment with was Figma. We spent the better part of a day learning to use Figma and making some designs for the websites look, layout and interactibility. Fortunately, picking up Figma was really simple as myself and another group member are very familiar with CorelDraw, which has very similar design tools with respect to object layering, properties and positioning.</p><p> Another tool we had the time to experiment with was the CSS libraries Tailwind and Flowbite. I had not had a particularly high opinion of the Bootstrap CSS library we had used up until that point, but Flowbite provided a lot of useful components and inline styling classes to work with. Though not all sunshine and roses to be sure!<p> This was also our first experience working under the agile development methodology. Starting out our project and condensing our ideas into a series of user stories, then dividing those up into sprint outlines was an incredibly useful tool for project management.</p><hr class=dashedLine /><p><strong>NOTE:</strong> The site, and the backend are both hosted for free on Render. It can be a little slow to respond sometimes. I promise the site works, sometimes Render doesn't.</p><p> Also, the API we used to acquire data from spotify ended up being a little limited. We ran out of requests on the free version rather quickly. There's a chance if you use it, that the API token has ran out of requests. If it seems like the site does not work, it is very likely the API requests have been exhausted for that token.",
          "name": "Social Music Site",
          "repo": "https://github.com/TaureHorn/music-site",
          "screenshot": "./images/screenshots/vanta.jpg",
          "skills": [
            "React",
            "Javascript",
            "Express",
            "MongoDB",
            "TailwindCSS"
          ],
          "url": "https://vanta-music.onrender.com/home"
        },
        {
          "info": "<p>A group project made over the course of a week as part of <a href=`https://thedeveloperacademy.com/` target=`_blank` class=linkBold>The Developer Academy</a> Web Dev Bootcamp. As a group we were tasked with making a website for events tracking using the MERN (Mongo, Express, React, Node) stack. Though we'd done projects for both frontend and backend using MERN, this was the first time we had done a full stack project.</p><p>This project was undertaken in my eighth week on the aforementioned coding bootcamp. This was something of a culmination of the previous three weeks learning how to build sites with React, and learning how to interact with web API's and how to build and interact with backend servers using Express and MongoDB.</p><p>If you wish to test the site, you can follow the link above. You will be greeted with a login page. You can use the following credentials to login.</p><p><strong>Username:</strong> guest</p><p><strong>Password:</strong> password</p><hr class=dashedLine /><p><strong>NOTE:</strong> The site, and the backend are both hosted for free on Render. It can be a little slow to respond sometimes. I promise the site works, sometimes Render doesn't ¯_(⊙︿⊙)_/¯</p>",
          "name": "Events Tracker",
          "repo": "https://github.com/TaureHorn/EventHandler",
          "screenshot": "./images/screenshots/events.png",
          "skills": ["React", "Javascript", "Express", "MongoDB", "Bootstrap"],
          "url": "https://eventhandler-ajfi.onrender.com/"
        },
        {
          "info": "<p>A small project built during my second week on <a href=`https://thedeveloperacademy.com/` target=`_blank` class=linkBold>The Developer Academy</a> Web Development Bootcamp. This week aimed to introduce the basics of JavaScript. As such we were tasked with writing a quiz. Having rather enjoyed the desing and CSS based aspects a lot in the previous weeks project this is where a lot of my effort was spent. Though that's not to say the JavaScript went ignored.</p><p> Design wise, the site was comprised of ~25% preamble story and ~75% quiz. A quick introduction to a character - Volo - and said character grilling you on your ability to identify mythological and fantastical creatures based on a few esoteric descriptions. I had a lot of fun with both the themeing of this project, both aesthetically and conceptually.</p><p> As for the JavaScript, as was the learning intention, it all worked out well. The code was simple in both concept and execution. A an array to track the answers, a series of functions to recieve and parse input, an array to track the number of correct answers and finally a big if - else to give an response tailored to how well the user did on the quiz. In hindsight, the code could definitely be refactored down to less than half its length. But, given that this was written a few days into learning JavaScript the fact that the quiz works at all is something of a success.</p>",
          "name": "Fantasy Bestiary Quiz",
          "repo": "https://github.com/TaureHorn/fantasy-bestiary-quiz",
          "screenshot": "./images/screenshots/quiz.jpg",
          "skills": ["HTML", "CSS", "Javascript", "Bootstrap"],
          "url": "https://taurehorn.github.io/fantasy-bestiary-quiz/"
        },
        {
          "info": "<p>a small project built during my first week on <a href=`https://thedeveloperacademy.com/` target=`_blank` class=linkBold>The Developer Academy</a> Web Development Bootcamp. prior to this i had never coded before, beyond changing some values in css and a writing couple of &lt;p&gt; and &lt;br&gt; tags in html. so i just wrote about something i know well, volcanoes! i spent most of my msc studying them so best that i get some use out of that knowledge.</p><p>this project took a couple of days to put together and was a good challenge considering i knew nothing about coding a few days prior to starting. getting to grips the powers of bootstrap and flexbox was a both interesting and frustrating experience. neveretheless, given the time invested and the knowledge gained i'm happy with this project. sure i could now make something better in half the time, sure it's kinda ugly and, sure there's no interactability or javascript to speak of: but for a html and css newb i'm pretty proud. </p><p> i utilised bootstrap components as much as i could to save time and effort configuring the minutae of CSS. Additionally, I enjoyed experimenting with different ways of achieveing the same effects in this site. For example, I used Bootstrap cards in two different configurations and used figures to control images as well. Just some things to accelerate my learning.</p>",
          "name": "Volcanoes Info",
          "repo": "https://github.com/TaureHorn/hobbyWebsite",
          "screenshot": "./images/screenshots/volcanoes.jpg",
          "skills": ["HTML", "CSS"],
          "url": "https://taurehorn.github.io/hobbyWebsite/"
        }
      ]
    },
    "Hobbies": {
      "metadata": {
        "explainer": "I do stuff outside of web dev, sit a while and listen",
        "name": "Hobby Projects"
      },
      "data": [
        {
          "info": "<p> When the country went into lockdown and work from home became a very popular thing I, like so many others, had to adjust. For a sense of psychological separation, I dual-booted my computer. I was using Windows at the time but installed regular old Ubuntu alongside for work. That was not my first experience using a linux OS, but it was certainly the first time I had attempted to use one for real work and for a signifcant length of time. As luck would have it, I decided I much preferred Ubuntu to Windows and soon completely transitioned to Ubuntu. KDE more specifically if you're aware of the significance.</p><p> Since switching over to linux I've been slowly teaching myself to use a bash terminal. Of course I'm no sysadmin command line wizard but I can <em> cd, ls, cat, sudo, mv, cp, ssh, find,</em> e.t.c with confidence. So far in my progress of learning web development, these skills have been a godsend when working with git and GitHub. Further, they were essential for a side project of setting up a Raspberry Pi as a Network Attatched Storage (NAS) device.</p><p> Of course, I can't easily exemplify those skills, so in their stead, I can show something else. Among other things, one stereotype of <em>some</em> linux users is their obssesion with customisation and showing off that customisation. In that vein, I customised the appearance of much of my KDE desktop environment to exactly suit my aesthetic preferences.</p>",
          "name": "Learning Linux",
          "screenshot": "./images/screenshots/KDE.png",
          "skills": ["Bash", "Docker", "Neovim"]
        },
        {
          "info": "<p>Perhaps you are reading this and thinking -<em>`This is supposed to be a professional portfolio for serious work. What is this idiot doing bragging about gathering with nerds and pretending to stab goblins in his leisure!`</em>-</p><p> Were it just that I play Dungeons and Dragons it would be a reasonable - if mean spirited - thing to think. The case however is a little more complicated and if you stick with me, I might be able to explain its relevance to my skills and as creative and commerically useful person.</p><p>I've played DnD for about the last 9 years. Starting just before the current 5th Ed came out - if you are familiar. For the past ~4 years of that time, I have been running my own game as a so called Dungeon Master, or DM. This role is absolutely integral to the funcitoning of any game of DnD. As a DM, it is my responsiblity to provide the players with a world, character and plot-lines to interact with and adventure in. And yes, sometimes there are goblins to stab. This game I have been running is what is called 'homebrew', meaning entirely custom and made by me. That means the world, all the characters, all the maps and all the plotlines are written by me. No small feat to keep a group of DnD nerds entertained on a weekly basis for that length of time I assure you. -Tens of thousands of words of text, hundreds of self-made maps e.t.c </p><p> Now, to the relevance to my skills. I run this game online and the players interact with the world with the help of maps that I make. These maps started out very simply, but slowly over the course of the last four years I have taught myself to draw and made the consious decision to put effort into the creativity it requires to make these maps. Thoug I have at this point made nearly 200 maps for this game, below are just three of which I am most proud and I think exemplify my artistic talents and creativity.</p>",
          "name": "Dungeons and Dragons",
          "screenshot": [
            "./images/screenshots/dnd_1.jpg",
            "./images/screenshots/dnd_2.jpg",
            "./images/screenshots/dnd_3.jpg",
            "./images/screenshots/dnd_4.jpg"
          ]
        }
      ]
    }
  }
}
